**FREE

      dcl-ds info;
           name char(10);
           dcl-ds addr pos(60) len(25);
             city char(10) pos(12);
           end-ds;
      end-ds;